Autodesk.Revit.DB.ImagePlacementOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ImagePlacementOptions.PlacementPoint
Identifies which point of the Autodesk.Revit.DB.ImageInstance will be aligned to the Autodesk.Revit.DB.ImagePlacementOptions.Location
Remarks:
The location of the corners of the image in the model depends on the size and orientation of the Autodesk.Revit.DB.ImageInstance
and the orientation of the view it is placed in.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2020

Autodesk.Revit.DB.ImagePlacementOptions.Location
The location in the model where a point of the Autodesk.Revit.DB.ImageInstance, determined by the Autodesk.Revit.DB.ImagePlacementOptions.PlacementPoint property, is going to be inserted.
Remarks:
The location represents a point in the model where the Autodesk.Revit.DB.ImageInstance will be placed.
The location of the image in the view is determined by the projection of this
point onto the plane of the view.
This means that in a plan view, for example, the z-coordinate has no effect.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2020

Autodesk.Revit.DB.ImagePlacementOptions.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.BoxPlacement)
Constructs a new ImagePlacementOptions for placing an Autodesk.Revit.DB.ImageInstance
location:
The location where the image will be placed
placementPoint:
The point of the image that will be aligned to the location in the view
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2020

Autodesk.Revit.DB.ImagePlacementOptions.#ctor
Constructs a new ImagePlacementOptions that will place an Autodesk.Revit.DB.ImageInstance with its center at the origin of the model
Since:
2020

Autodesk.Revit.DB.ImagePlacementOptions
ImagePlacementOptions are used to describe where an Autodesk.Revit.DB.ImageInstance should be placed in a view
Since:
2020